Revit 2027 API
TableCellStyle.BackgroundColor Property
 The background color of this cell in the grid view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
public:
property Color^ BackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
member BackgroundColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace